b=int(input("Введите превый элемнт прогрессии"))#ввод переменной b
q=int(input("Введите множитель прогрессии"))# ввод переменной q
n=int(input("Введите номер последнего элемента"))# ввод переменной n
if b>= -10000 and b<=10000: # область допустимых значений для переменной b
    if  q>=1 and q<= 50:# # область допустимых значений для переменной q
        if n>=2 and n<=100:# # область допустимых значений для переменной n
            print( b * (q**n - 1) // (q - 1))# вывод и расчет формулы геометрической прогресии
        else : #проверка на ошибку переменной n
            print ("Ошибка в переменной")# вывод ошибки в задании переменной при наличии таковой
    elif q==1:#доп условие если знаменатель прогресси равен 1
        if n>=2 and n<=100:# условие для знаменатиля не равного 1
            print(b*n)#расчет формулы в случае если знаминатель равен 1
        else: print ("Ошибка в переменной") #вывод ошибки если n не принадлежит промежутку [2;100]
    else : print ("Ошибка в переменной") #вывод ошибки если q не принадлежит промежутку [1;50]
else : print ("Ошибка в переменной") #вывод ошибки если b не принадлежит промежутку [-10000;10000] 
       
   
           
















