n = int(input("введите число n")) # ввод числа
a=0 #отсчет начинается с 0
if n >=1 and n<=25: # область допустимых значений числа 
    for i in range(2, int(n**0.5) + 1):#число является простым если не делится на числа от 2 до корня из самого себя
         if n % i == 0:#обновление до 0
            a+=1#прибавляем 1
    if a>0:# условия для вывода ответа 
        print("N")# a>0 значит у числа есть делитель
    else:
        print("Y")# a не больше нуля значит оно простое
else:
     print("n не входит в диапазон")  # число не входит в диапазон
